Revit 2027 API
BuiltInFailures.FamilyFailures.NonGenericAnnotationsOutsideLegend Property
 Only Generic Annotations may be copied between Legends and other Views
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NonGenericAnnotationsOutsideLegend { get; }
Public Shared ReadOnly Property NonGenericAnnotationsOutsideLegend As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NonGenericAnnotationsOutsideLegend {
	FailureDefinitionId^ get ();
}
static member NonGenericAnnotationsOutsideLegend : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace